<?php
//             Access              //
//         all, authorized         //
//   group['guest', 'user', 'installer', 'moderator', 'admin']   //
//            users[]              //

/*
Пока работает только включение/отключение авторизации
Не выполнено сравнение по группам
*/

return [
	//----------------------------------------------------------------------//
	//                               Главная                                //
	//----------------------------------------------------------------------//
	//'(\?{1}(\d|\w|\=|\&)*)?' => [		// С передачей GET запросов: ?key1=1&key2=2...
	'(\?{1}[\D\w]*)?' => [		// С передачей GET запросов: ?key1=1&key2=2...
		'controller' => 'main',
		'action' => 'index',
		'access' => 'authorized'
	],


	//----------------------------------------------------------------------//
	//                             Авторизация                              //
	//----------------------------------------------------------------------//
	'account/register' => [
		'controller' => 'account',
		'action' => 'register'
	],
	'account/login' => [
		'controller' => 'account',
		'action' => 'login'
	],
	'account/logout' => [
		'controller' => 'account',
		'action' => 'loguot'
	],
	'account/settings' => [
		'controller' => 'account',
		'action' => 'settings',
		'access' => 'authorized'
	],


	//----------------------------------------------------------------------//
	//                               Админ                                  //
	//----------------------------------------------------------------------//
	'admin' => [
		'controller' => 'admin',
		'action' => 'index',
		'access' => 'admin'
	],



	//----------------------------------------------------------------------//
	//                              Новости                                //
	//----------------------------------------------------------------------//
	'news/show' => [
		'controller' => 'news',
		'action' => 'show',
		'access' => 'authorized'
	]
];
